-- MySQL dump 10.13  Distrib 8.0.20, for Linux (x86_64)
--
-- Host: localhost    Database: yobet_new_dev
-- ------------------------------------------------------
-- Server version	8.0.20

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `banks`
--

DROP TABLE IF EXISTS `banks`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `banks` (
  `id` int unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `code` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `remark` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `state` tinyint unsigned NOT NULL DEFAULT '0',
  `sort` tinyint unsigned NOT NULL DEFAULT '0',
  `icon` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '标',
  `image` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '图',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`),
  UNIQUE KEY `code` (`code`)
) ENGINE=InnoDB AUTO_INCREMENT=164 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `banks`
--

LOCK TABLES `banks` WRITE;
/*!40000 ALTER TABLE `banks` DISABLE KEYS */;
INSERT INTO `banks` VALUES (1,'国家开发银行','CDB','国家开发银行',1,0,'',''),(2,'中国工商银行','ICBC','中国工商银行',0,0,'','/uploads/2020/07/16/zNDfNxRO7pk5Eelq.png'),(3,'中国农业银行','ABC','中国农业银行',0,0,'','/uploads/2020/07/16/KmtR42Uw72a0QuRK.png'),(4,'中国银行','BOC','中国银行',0,0,'','/uploads/2020/07/16/ryxhZ0EJRmgCBQFa.png'),(5,'中国建设银行','CCB','中国建设银行',0,0,'','/uploads/2020/07/16/KhWMl8Su1OIoFmoa.png'),(6,'中国邮政储蓄银行','PSBC','中国邮政储蓄银行',0,0,'','/uploads/2020/07/16/FfYD7yymMicPKl3n.png'),(7,'交通银行','COMM','交通银行',0,0,'','/uploads/2020/07/16/vSkGyJtQIkDFCq1G.png'),(8,'招商银行','CMB','招商银行',0,0,'','/uploads/2020/07/16/nLZabrXmXxuDJOhZ.png'),(9,'上海浦东发展银行','SPDB','上海浦东发展银行',0,0,'',''),(10,'兴业银行','CIB','兴业银行',0,0,'','/uploads/2020/07/16/jkdRsvtx2IaNQZxL.png'),(11,'华夏银行','HXBANK','华夏银行',0,0,'','/uploads/2020/07/16/fpXwP7UMv3QGlmpm.png'),(12,'广东发展银行','GDB','广东发展银行',0,0,'','/uploads/2020/07/16/bLKUrvAUlizEtRtR.png'),(13,'中国民生银行','CMBC','中国民生银行',0,0,'','/uploads/2020/07/16/H4YRcrchwrGV2axr.png'),(14,'中信银行','CITIC','中信银行',0,0,'','/uploads/2020/07/16/TPeriEdkRBf7BCI5.png'),(15,'中国光大银行','CEB','中国光大银行',0,0,'','/uploads/2020/07/16/zBoSvB4JdH7fSSOA.png'),(16,'恒丰银行','EGBANK','恒丰银行',0,0,'',''),(17,'浙商银行','CZBANK','浙商银行',0,0,'',''),(18,'渤海银行','BOHAIB','渤海银行',0,0,'',''),(19,'平安银行','SPABANK','平安银行',0,0,'',''),(20,'上海农村商业银行','SHRCB','上海农村商业银行',0,0,'',''),(21,'玉溪市商业银行','YXCCB','玉溪市商业银行',0,0,'',''),(22,'尧都农商行','YDRCB','尧都农商行',0,0,'',''),(23,'北京银行','BJBANK','北京银行',0,0,'',''),(24,'上海银行','SHBANK','上海银行',0,0,'',''),(25,'江苏银行','JSBANK','江苏银行',0,0,'',''),(26,'杭州银行','HZCB','杭州银行',0,0,'',''),(27,'南京银行','NJCB','南京银行',0,0,'',''),(28,'宁波银行','NBBANK','宁波银行',0,0,'',''),(29,'徽商银行','HSBANK','徽商银行',0,0,'',''),(30,'长沙银行','CSCB','长沙银行',0,0,'',''),(31,'成都银行','CDCB','成都银行',0,0,'',''),(32,'重庆银行','CQBANK','重庆银行',0,0,'',''),(33,'大连银行','DLB','大连银行',0,0,'',''),(34,'南昌银行','NCB','南昌银行',0,0,'',''),(35,'福建海峡银行','FJHXBC','福建海峡银行',0,0,'',''),(36,'汉口银行','HKB','汉口银行',0,0,'',''),(37,'温州银行','WZCB','温州银行',0,0,'',''),(38,'青岛银行','QDCCB','青岛银行',0,0,'',''),(39,'台州银行','TZCB','台州银行',0,0,'',''),(40,'嘉兴银行','JXBANK','嘉兴银行',0,0,'',''),(41,'常熟农村商业银行','CSRCB','常熟农村商业银行',0,0,'',''),(42,'南海农村信用联社','NHB','南海农村信用联社',0,0,'',''),(43,'常州农村信用联社','CZRCB','常州农村信用联社',0,0,'',''),(44,'内蒙古银行','H3CB','内蒙古银行',0,0,'',''),(45,'绍兴银行','SXCB','绍兴银行',0,0,'',''),(46,'顺德农商银行','SDEB','顺德农商银行',0,0,'',''),(47,'吴江农商银行','WJRCB','吴江农商银行',0,0,'',''),(48,'齐商银行','ZBCB','齐商银行',0,0,'',''),(49,'贵阳市商业银行','GYCB','贵阳市商业银行',0,0,'',''),(50,'遵义市商业银行','ZYCBANK','遵义市商业银行',0,0,'',''),(51,'湖州市商业银行','HZCCB','湖州市商业银行',0,0,'',''),(52,'龙江银行','DAQINGB','龙江银行',0,0,'',''),(53,'晋城银行JCBANK','JINCHB','晋城银行JCBANK',0,0,'',''),(54,'浙江泰隆商业银行','ZJTLCB','浙江泰隆商业银行',0,0,'',''),(55,'广东省农村信用社联合社','GDRCC','广东省农村信用社联合社',0,0,'',''),(56,'东莞农村商业银行','DRCBCL','东莞农村商业银行',0,0,'',''),(57,'浙江民泰商业银行','MTBANK','浙江民泰商业银行',0,0,'',''),(58,'广州银行','GCB','广州银行',0,0,'',''),(59,'辽阳市商业银行','LYCB','辽阳市商业银行',0,0,'',''),(60,'江苏省农村信用联合社','JSRCU','江苏省农村信用联合社',0,0,'',''),(61,'廊坊银行','LANGFB','廊坊银行',0,0,'',''),(62,'浙江稠州商业银行','CZCB','浙江稠州商业银行',0,0,'',''),(63,'德阳商业银行','DYCB','德阳商业银行',0,0,'',''),(64,'晋中市商业银行','JZBANK','晋中市商业银行',0,0,'',''),(65,'苏州银行','BOSZ','苏州银行',0,0,'',''),(66,'桂林银行','GLBANK','桂林银行',0,0,'',''),(67,'乌鲁木齐市商业银行','URMQCCB','乌鲁木齐市商业银行',0,0,'',''),(68,'成都农商银行','CDRCB','成都农商银行',0,0,'',''),(69,'张家港农村商业银行','ZRCBANK','张家港农村商业银行',0,0,'',''),(70,'东莞银行','BOD','东莞银行',0,0,'',''),(71,'莱商银行','LSBANK','莱商银行',0,0,'',''),(72,'北京农村商业银行','BJRCB','北京农村商业银行',0,0,'',''),(73,'天津农商银行','TRCB','天津农商银行',0,0,'',''),(74,'上饶银行','SRBANK','上饶银行',0,0,'',''),(75,'富滇银行','FDB','富滇银行',0,0,'',''),(76,'重庆农村商业银行','CRCBANK','重庆农村商业银行',0,0,'',''),(77,'鞍山银行','ASCB','鞍山银行',0,0,'',''),(78,'宁夏银行','NXBANK','宁夏银行',0,0,'',''),(79,'河北银行','BHB','河北银行',0,0,'',''),(80,'华融湘江银行','HRXJB','华融湘江银行',0,0,'',''),(81,'自贡市商业银行','ZGCCB','自贡市商业银行',0,0,'',''),(82,'云南省农村信用社','YNRCC','云南省农村信用社',0,0,'',''),(83,'吉林银行','JLBANK','吉林银行',0,0,'',''),(84,'东营市商业银行','DYCCB','东营市商业银行',0,0,'',''),(85,'昆仑银行','KLB','昆仑银行',0,0,'',''),(86,'鄂尔多斯银行','ORBANK','鄂尔多斯银行',0,0,'',''),(87,'邢台银行','XTB','邢台银行',0,0,'',''),(88,'晋商银行','JSB','晋商银行',0,0,'',''),(89,'天津银行','TCCB','天津银行',0,0,'',''),(90,'营口银行','BOYK','营口银行',0,0,'',''),(91,'吉林农信','JLRCU','吉林农信',0,0,'',''),(92,'山东农信','SDRCU','山东农信',0,0,'',''),(93,'西安银行','XABANK','西安银行',0,0,'',''),(94,'河北省农村信用社','HBRCU','河北省农村信用社',0,0,'',''),(95,'宁夏黄河农村商业银行','NXRCU','宁夏黄河农村商业银行',0,0,'',''),(96,'贵州省农村信用社','GZRCU','贵州省农村信用社',0,0,'',''),(97,'阜新银行','FXCB','阜新银行',0,0,'',''),(98,'湖北银行黄石分行','HBHSBANK','湖北银行黄石分行',0,0,'',''),(99,'浙江省农村信用社联合社','ZJNX','浙江省农村信用社联合社',0,0,'',''),(100,'新乡银行','XXBANK','新乡银行',0,0,'',''),(101,'湖北银行宜昌分行','HBYCBANK','湖北银行宜昌分行',0,0,'',''),(102,'乐山市商业银行','LSCCB','乐山市商业银行',0,0,'',''),(103,'江苏太仓农村商业银行','TCRCB','江苏太仓农村商业银行',0,0,'',''),(104,'驻马店银行','BZMD','驻马店银行',0,0,'',''),(105,'赣州银行','GZB','赣州银行',0,0,'',''),(106,'无锡农村商业银行','WRCB','无锡农村商业银行',0,0,'',''),(107,'广西北部湾银行','BGB','广西北部湾银行',0,0,'',''),(108,'广州农商银行','GRCB','广州农商银行',0,0,'',''),(109,'江苏江阴农村商业银行','JRCB','江苏江阴农村商业银行',0,0,'',''),(110,'平顶山银行','BOP','平顶山银行',0,0,'',''),(111,'泰安市商业银行','TACCB','泰安市商业银行',0,0,'',''),(112,'南充市商业银行','CGNB','南充市商业银行',0,0,'',''),(113,'重庆三峡银行','CCQTGB','重庆三峡银行',0,0,'',''),(114,'中山小榄村镇银行','XLBANK','中山小榄村镇银行',0,0,'',''),(115,'邯郸银行','HDBANK','邯郸银行',0,0,'',''),(116,'库尔勒市商业银行','KORLABANK','库尔勒市商业银行',0,0,'',''),(117,'锦州银行','BOJZ','锦州银行',0,0,'',''),(118,'齐鲁银行','QLBANK','齐鲁银行',0,0,'',''),(119,'青海银行','BOQH','青海银行',0,0,'',''),(120,'阳泉银行','YQCCB','阳泉银行',0,0,'',''),(121,'盛京银行','SJBANK','盛京银行',0,0,'',''),(122,'抚顺银行','FSCB','抚顺银行',0,0,'',''),(123,'郑州银行','ZZBANK','郑州银行',0,0,'',''),(124,'深圳农村商业银行','SRCB','深圳农村商业银行',0,0,'',''),(125,'潍坊银行','BANKWF','潍坊银行',0,0,'',''),(126,'九江银行','JJBANK','九江银行',0,0,'',''),(127,'江西省农村信用','JXRCU','江西省农村信用',0,0,'',''),(128,'河南省农村信用','HNRCU','河南省农村信用',0,0,'',''),(129,'甘肃省农村信用','GSRCU','甘肃省农村信用',0,0,'',''),(130,'四川省农村信用','SCRCU','四川省农村信用',0,0,'',''),(131,'广西省农村信用','GXRCU','广西省农村信用',0,0,'',''),(132,'陕西信合','SXRCCU','陕西信合',0,0,'',''),(133,'武汉农村商业银行','WHRCB','武汉农村商业银行',0,0,'',''),(134,'宜宾市商业银行','YBCCB','宜宾市商业银行',0,0,'',''),(135,'昆山农村商业银行','KSRB','昆山农村商业银行',0,0,'',''),(136,'石嘴山银行','SZSBK','石嘴山银行',0,0,'',''),(137,'衡水银行','HSBK','衡水银行',0,0,'',''),(138,'信阳银行','XYBANK','信阳银行',0,0,'',''),(139,'鄞州银行','NBYZ','鄞州银行',0,0,'',''),(140,'张家口市商业银行','ZJKCCB','张家口市商业银行',0,0,'',''),(141,'许昌银行','XCYH','许昌银行',0,0,'',''),(142,'济宁银行','JNBANK','济宁银行',0,0,'',''),(143,'开封市商业银行','CBKF','开封市商业银行',0,0,'',''),(144,'威海市商业银行','WHCCB','威海市商业银行',0,0,'',''),(145,'湖北银行','HBC','湖北银行',0,0,'',''),(146,'承德银行','BOCD','承德银行',0,0,'',''),(147,'丹东银行','BODD','丹东银行',0,0,'',''),(148,'金华银行','JHBANK','金华银行',0,0,'',''),(149,'朝阳银行','BOCY','朝阳银行',0,0,'',''),(150,'临商银行','LSBC','临商银行',0,0,'',''),(151,'包商银行','BSB','包商银行',0,0,'',''),(152,'兰州银行','LZYH','兰州银行',0,0,'',''),(153,'周口银行','BOZK','周口银行',0,0,'',''),(154,'德州银行','DZBANK','德州银行',0,0,'',''),(155,'三门峡银行','SCCB','三门峡银行',0,0,'',''),(156,'安阳银行','AYCB','安阳银行',0,0,'',''),(157,'安徽省农村信用社','ARCU','安徽省农村信用社',0,0,'',''),(158,'湖北省农村信用社','HURCB','湖北省农村信用社',0,0,'',''),(159,'湖南省农村信用社','HNRCC','湖南省农村信用社',0,0,'',''),(160,'广东南粤银行','NYNB','广东南粤银行',0,0,'',''),(161,'洛阳银行','LYBANK','洛阳银行',0,0,'',''),(162,'农信银清算中心','NHQS','农信银清算中心',0,0,'',''),(163,'城市商业银行资金清算中心','CBBQS','城市商业银行资金清算中心',0,0,'','');
/*!40000 ALTER TABLE `banks` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-08-17  9:52:19
